alex-roos-website.org
#+TITLE: Alex Roos Work Website
#+STARTUP: content
# #+HUGO_BASE_DIR: /sshx:tipxmr:/home/tipxmr/alex-roos/
#+HUGO_BASE_DIR: /home/alex/Coding/alex-roos/
# #+HUGO_AUTO_SET_LASTMOD: t
#+AUTHOR: Alex Roos

** DONE RaspberryPi and Networking
:PROPERTIES:
:EXPORT_FILE_NAME: RaspberryPi
:EXPORT_HUGO_SECTION: thoughts
:EXPORT_HUGO_TAGS: linux network docker
:EXPORT_HUGO_PUBLISHDATE: 2021-03-03
:END:
The first RaspberryPi I bought was for my own Bitcoin/Lightning-Network node ([[https://raspiblitz.org/][RaspiBlitz]]). Building this project was a great learning experience and it introduced me to the idea of self-hosted software services.
*** Using the RaspberryPi
One of the first real use-cases I found for a RaspberryPi was to host my Telegram Bots. Since they require the running computer to be always online. Therefore, my solution to hosting bots written in [[Python]] is to create a service on the Pi that executes the main script on start-up.

Another great practice was just to ssh into the Pi and do work from within the terminal. I found out about ssh-keys that way!

I also discovered, that [[Doom Emacs]] allows me to ssh connect over [[https://www.emacswiki.org/emacs/TrampMode][Tramp]] and edit remote files on my local machine with my local config.
*** My own home server
I have previously deployed my own [[https://nextcloud.com/][Nextcloud]] instance on a RaspberryPi, which taught me a lot about networking, port forwarding, SSL certificates and much more.

Moreover, the Pi has opened the world of docker for me!

Just as a side note: Nowadays I use a Pi as my home server and run [[https://syncthing.net/][SyncThing]] to keep all my ~.org~ files synced between my laptop and phone.

It truly amazes me that this tech exists at such a low price point!

